# mysql과 python 연동
1. 라이브러리 설치
2. sql 서버의 정보를 등록
3. sql 서버에 접속
4. sql 쿼리문을 이용하여 데이터를 CRUD 작업

In [ ]:
# pymysql 설치
!pip install pymysql

In [ ]:
import pymysql

In [ ]:
# sql 서버의 정보를 입력
_db = pymysql.connect(
    user = 'root', 
    password = '1234', 
    host = 'localhost', 
    db = 'ubion_test', 
    port = 3306
)

In [ ]:
_db2 = pymysql.connect(
    user = 'ubion', 
    password = '1234', 
    host = 'localhost', 
    db = 'ubion7', 
    port = 3306
)

In [ ]:
# cursor변수 생성
# sql 쿼리문을 실행 시키지 위한 필수 변수
# Dictcursor는 sql 쿼리문이 실행되고 나온 데이터를 딕셔너리 형태로 받는다.
cursor = _db.cursor(pymysql.cursors.DictCursor)

In [ ]:
sql = """
    select 
    * 
    from 
    user_info
"""

cursor.execute(sql)

In [ ]:
result = cursor.fetchall()

In [ ]:
import pandas as pd

In [ ]:
pd.DataFrame(result)

In [ ]:
sql = """
    select 
    * 
    from 
    example
"""

cursor.execute(sql)
result = cursor.fetchall()
df = pd.DataFrame(result)
df

In [ ]:
sql = """
    insert into
    user_info 
    values 
    ("test5", "1234", "test5", "01011118888", 1)
"""

cursor.execute(sql)

In [ ]:
_db.commit()

### sql 함수화
1. 첫 번째 함수
    - 매개변수 1개(sql 쿼리문)
    - sql 쿼리문을 실행하고 결과를 데이터프레임으로 변경하여 리턴
2. 두 번째 함수
    - 매개변수 1개(sql 쿼리문)
    - sql 쿼리문을 실행하고 데이터베이스를 변경

3. 세 번째 함수
    - 1번 함수와 2번 함수를 하나의 함수에서 실행이 될수 있도록 생성

In [ ]:
def sql_select(sql):
    # 쿼리문 실행
    cursor.execute(sql)
    # 쿼리문에 대한 결과
    result = cursor.fetchall()
    df = pd.DataFrame(result)
    return df

In [ ]:
sql = """
    select
    * 
    from 
    user_info
"""
sql_select(sql)

In [ ]:
def _sql(sql, values):
    cursor.execute(sql, values)
    _db.commit()

In [ ]:
sql = """
    insert into 
    user_info 
    values 
    (%s, %s, %s, %s, %s)
"""

values = ["test10", "12234", "test10", "01077777777", 1]

_sql(sql, values)

In [ ]:
sql = """
    select 
    * 
    from 
    user_select
"""

sql.find('select')
sql.replace('\n', '').strip().startswith('select')

In [ ]:
def sql_query(sql, values = []):
    # if (sql.find("select") != -1) and (sql.find('select') < 10):
    if (sql.replace('\n', '').strip().startswith('select')):
        cursor.execute(sql, values)
        result = cursor.fetchall()
        result = pd.DataFrame(result)
    else:
        cursor.execute(sql, values)
        _db.commit()
        result = "Query OK"
    return result

In [ ]:
sql = """
    select 
    * 
    from
    user_info
"""

sql_query(sql)

In [ ]:
sql = """
    delete 
    from 
    user_info 
    where 
    user_id = %s
"""

values = ['test10']

sql_query(sql, values)

In [ ]:
import mod_sql

In [57]:
test = mod_sql.Database(
    _host= 'localhost', 
    _user= 'root', 
    _pass = '1234', 
    _db = 'ubion', 
    _port = 3306)

In [ ]:
sql = """
    select 
    * 
    from 
    user_info
"""
test.sql_query(sql)

In [ ]:
test2 = mod_sql.Database(
    '172.16.11.148', 
    'ubion', 
    '1234', 
    'ubion7', 
    3306
)

In [56]:
sql = """
    select 
    `Name` as '이름', 
    `Phone` as '휴대폰번호'
    from 
    example 
    where 
    `Gender` = %s
    limit 3
"""
values = ['female']
test.sql_query(sql, values)

  이름          휴대폰번호
0  B  010-1234-5679
1  D  010-1234-5681
2  F  010-1234-5683